wavetest/case2b1/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
       type            fixedValue;
        value           uniform (0 0 0);
    }
	
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

   

    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontandback
    {
        type            empty;
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	
	floatingObject
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    oversetPatch
    {
        type            overset;
    }

    sides
    {
	type		overset;
    }
}

// ************************************************************************* //
