wavetest/case2b1/background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    oversetPatch
    {
        type            overset;
    }

    frontandback
    {
        type            empty;
    }

    inlet
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            fixedFluxPressure;
    }

    ground
    {
        type            fixedFluxPressure;
    }

    

    atmosphere
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
	
	floatingObject
    {
        type            fixedFluxPressure;
        
    }
	
    overset
    {
        type            overset;
        type            fixedFluxPressure;
    }

    sides
    {
	patchType	overset;
	type		fixedFluxPressure;
    }
}

// ************************************************************************* //
